"""Напишіть програму для отримання рядка Фібоначчі від 0 до n, де n - ціле число.
Послідовність Фібоначчі - це серія чисел 0, 1, 1, 2, 3, 5, 8, 13, 21, .... 
Кожне наступне число знайдено шляхом додавання двох чисел перед ним.
Голомоза Інна Андріївна"""

n = int(input("Введіть кількість чисел Фібоначчі (n): "))

# Ініціалізація змінних
prev = 0
current = 1

# Виведення перших двох чисел Фібоначчі
print(0)
print(1)

for _ in range(2, n):
    next = prev + current
    print(next)
    prev, current = current, next
