"""Визначте середнє значення всіх елементів послідовності, яка завершується
числом 0. Вводиться послідовність цілих чисел, що закінчується числом 0 
(саме число 0 в послідовність не входить, а використовується як ознака 
її закінчення).
Голомоза Інна Андріївна"""

total = 0 #Ініціалізація змінних
count = 0

print("Введіть послідовність чисел, яка завершується 0")
    
while True:
    num = int(input("Введіть число (0 для завершення): "))
    if num == 0:
        break  # Вихід з циклу, якщо введено 0
    else:
        total += num
        count += 1

# Обчислення та виведення середнього значення
if count > 0:
    average = total / count
    print(f"Середнє значення: {average:.2f}")
else:
    print("Послідовність порожня. Неможливо визначити середнє значення.")
